init.el
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

(scroll-bar-mode -1) ;; Turn off scroll bar
(tool-bar-mode -1) ;; Turn off tool bar
(menu-bar-mode -1) ;; Turn off menu bar
(tooltip-mode -1) ;; Turn off tooltips 
(set-fringe-mode 10) ;; Set left & right blank to 10 pixels

(setq inhibit-startup-message t)

(defun mine/font-settings ()
  (set-face-attribute 'default nil :font "monospace")
  (set-face-attribute 'variable-pitch nil :font "sans")
  (set-fontset-font t 'han "monospace")
  (set-fontset-font t 'kana "monospace")
  (set-fontset-font t 'cjk-misc "monospace")
  (set-fontset-font t 'symbol "monospace"))

(add-hook 'server-after-make-frame-hook #'mine/font-settings) ;; For client mode
(mine/font-settings) ;; For GUI mode

(column-number-mode)
(global-display-line-numbers-mode t)
(dolist (mode '(org-mode-hook
		eshell-mode-hook
		vterm-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq enable-recursive-minibuffers t)

(setq read-extended-command-predicate #'command-completion-default-include-p)

(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https:/orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
(setq use-package-compute-statistics t)

(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results nil)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))

(defvar --backup-directory (concat user-emacs-directory "backups"))
(if (not (file-exists-p --backup-directory))
    (make-directory --backup-directory t))
(setq backup-directory-alist `(("." . ,--backup-directory)))
(setq make-backup-files t               ; backup of a file the first time it is saved.
      backup-by-copying t               ; don't clobber symlinks
      version-control t                 ; version numbers for backup files
      delete-old-versions t             ; delete excess backup files silently
      delete-by-moving-to-trash t
      kept-old-versions 6               ; oldest versions to keep when a new numbered backup is made (default: 2)
      kept-new-versions 9               ; newest versions to keep when a new numbered backup is made (default: 2)
      auto-save-default t               ; auto-save every buffer that visits a file
      auto-save-timeout 20              ; number of seconds idle time before auto-save (default: 30)
      auto-save-interval 200            ; number of keystrokes between auto-saves (default: 300)
      )

(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-solarized-light t) ; use solarized light theme

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package nerd-icons)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(keymap-global-set "<escape>" 'keyboard-escape-quit)

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode)
  :custom
  (evil-respect-visual-line-mode 1)
  (evil-undo-system 'undo-redo))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(add-hook 'org-mode-hook
          (lambda () (setq evil-auto-indent nil)))

(use-package general
  :config
  (general-evil-setup t)
  (general-create-definer mine/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC") ;; <C-SPC> is contradict to fcitx5 default settings, should turn off fcitx5 in most cases

  (mine/leader-keys
    "l" '(:ignore t :which-key "ledger-mode")
    "lr" '(ledger-report
	   :which-key "report")
    
    "o" '(:ignore t :which-key "org-mode")
    "oa" '(org-agenda
           :which-key "agenda")
    "or" '(org-redisplay-inline-images
           :which-key "redisplay inline images")
    "ol" '(org-latex-preview
           :which-key "preview LaTeX")
    "oi" '((lambda () (interactive)
             (find-file (concat org-directory "/index.org")))
           :which-key "open index")
    "oc" '(org-capture
	   :which-key "capture")

    "s" '(:ignore t :which-key "start")
    "se" #'(mine/shell-create
	    :which-key "start eshell")

    "t" '(:ignore t :which-key "toggles")
    "tt" '(consult-theme
           :which-key "choose-theme")

    "n" '(:ignore t :which-key "org-roam")
    "nf" '(org-roam-node-find :which-key "find a roam node")
    "ni" '(org-roam-node-insert :which-key "insert a roam node")
    "nl" '((lambda () (interactive)
	      (org-roam-buffer-display-dedicated
	       (org-roam-node-at-point)))
	    :which-key "show backlinks")
    "nd" '(:ignore t :which-key "dailies")
    "ndn" '(org-roam-dailies-capture-today
            :which-key "capture today")
    "ndd" '(org-roam-dailies-goto-today
            :which-key "goto today")
    "ndT" '(org-roam-dailies-capture-tomorrow
            :which-key "capture tomorrow")
    "ndt" '(org-roam-dailies-goto-tomorrow
            :which-key "goto tomorrow")
    "ndY" '(org-roam-dailies-capture-yesterday
            :which-key "capture yesterday")
    "ndy" '(org-roam-dailies-goto-yesterday
            :which-key "goto yesterday")

    "x" '(:keymap perspective-map :package perspective)))

(use-package vertico
  :diminish
  :init
  (vertico-mode 1)
  :bind (:map vertico-map
              ("C-j" . vertico-next)
              ("C-k" . vertico-previous))
  :custom
  (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
  )

(use-package orderless
  :after vertico
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

(use-package consult
  :bind (("C-x b" . consult-buffer)
	 ("M-p" . consult-project-buffer)
         ("C-s" . consult-line)))

(use-package marginalia
 :init
 (marginalia-mode 1))
