init.org
** Corfu

[[https://github.com/minad/corfu][Corfu]] is a in-buffer completion.

#+begin_src emacs-lisp :tangle yes
  (use-package corfu
    :hook
    (prog-mode . corfu-mode)
    (ledger-mode . corfu-mode)
    (eshell-mode . corfu-mode)
    :custom
    (corfu-auto t)
    (corfu-auto-prefix 3)
    (corfu-auto-delay 0.0)
    :config
    (keymap-unset corfu-map "RET"))
#+end_src

*** Icons

#+begin_src emacs-lisp
  (use-package nerd-icons-corfu
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src

* Help

** Which key

Which shows key descriptions for most compatible key-bindings. Very useful for learn a new package or setup.

#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src

** Helpful

Helpful is a help page rewriter that provides more functionalities.

#+begin_src emacs-lisp
  (use-package helpful
    :bind
    ([remap describe-function] . helpful-callable)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))
#+end_src

* Work groups

** Perspective

=Perspective.el= provides multiple named workspaces.

#+begin_src emacs-lisp
  (use-package perspective
    :bind
    ("C-x C-b" . persp-list-buffers)
    :custom
    (persp-state-default-file (expand-file-name "persp-state" user-emacs-directory))
    (persp-mode-prefix-key (kbd "C-c M-p"))  ; pick your own prefix key here
    :init
    (persp-mode)
    :config
    (add-hook 'kill-emacs-hook #'persp-state-save)
    (add-hook 'after-init-hook
              (lambda () (persp-state-load persp-state-default-file)))
    (with-eval-after-load 'consult
      (consult-customize consult--source-buffer :hidden t :default nil)
      (add-to-list 'consult-buffer-sources persp-consult-source)))
#+end_src

** Tabspace
Tabspace is a convenient wrapper for =tab-bar.el= and =project.el=
#+begin_src emacs-lisp :tangle no
  (use-package tabspaces
    :hook (after-init . tabspaces-mode) ;; use this only if you want the minor-mode loaded at startup. 
    :commands (tabspaces-switch-or-create-workspace
               tabspaces-open-or-create-project-and-workspace)
    :custom
    (tabspaces-use-filtered-buffers-as-default t)
    (tabspaces-default-tab "Default")
    (tabspaces-remove-to-default t)
    (tabspaces-include-buffers '("*scratch*"))
    (tabspaces-initialize-project-with-todo t)
    (tabspaces-todo-file-name "project-todo.org")
    ;; sessions
    (tabspaces-session t)
    (tabspaces-session-auto-restore t)
    (tab-bar-new-tab-choice "*scratch*")
    :config
    ;; Filter Buffers for Consult-Buffer
    (with-eval-after-load 'consult
      ;; hide full buffer list (still available with "b" prefix)
      (consult-customize consult--source-buffer :hidden t :default nil)
      ;; set consult-workspace buffer list
      (defvar consult--source-workspace
        (list :name     "Workspace Buffers"
              :narrow   ?w
              :history  'buffer-name-history
              :category 'buffer
              :state    #'consult--buffer-state
              :default  t
              :items    (lambda () (consult--buffer-query
                                  :predicate #'tabspaces--local-buffer-p
                                  :sort 'visibility
                                  :as #'buffer-name)))

        "Set workspace buffer list for consult-buffer.")
      (add-to-list 'consult-buffer-sources 'consult--source-workspace)))

#+end_src

* Development

** Languages

*** LSP

Use [[https://github.com/joaotavora/eglot][eglot]] for lsp functionalities.

#+begin_src emacs-lisp
  (use-package eglot
    :hook
    (rust-mode . eglot-ensure)
    (python-mode . eglot-ensure)
    :config
    ;; Change the inlay hint face to make it slightly more visible
    (set-face-attribute 'eglot-inlay-hint-face nil :foreground "#8ba34a"))
#+end_src

*** Python

Load venv.

#+begin_src emacs-lisp
  (use-package python
    :mode ("\\.py\\'" . python-mode)
    :interpreter ("python" . python-mode)
    :custom
    (python-shell-virtualenv-root "~/venv"))
#+end_src

*** Rust

#+begin_src emacs-lisp
  (use-package rust-mode)
#+end_src

*** Scheme

#+begin_src emacs-lisp
  (use-package geiser)

  (use-package geiser-guile
    :after geiser
    :custom
    (geiser-active-implementations '(guile))
    (geiser-guile-binary "/usr/bin/guile")
    (geiser-repl-autodoc-p t))

  (use-package paredit
    :hook (scheme-mode . paredit-mode))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (26606 36645 452935 337000) :init (26606 36645 452932 331000) :config (26606 36645 452920 559000) :config-secs (0 0 3 577000) :init-secs (0 0 555534 615000) :use-package-secs (0 0 555684 40000)))

** Flycheck

Use flycheck to handle diagnostics.

#+begin_src emacs-lisp
  ;; (use-package flycheck
  ;;   :ensure t
  ;;   :init
  ;;   (global-flycheck-mode)
  ;;   (flymake-mode -1)
  ;;   :custom
  ;;   (lsp-diagnostics-provider :flycheck))
#+end_src

** Folding

Use origami to handle code folding

#+begin_src emacs-lisp
  (use-package origami
    :hook (prog-mode . origami-mode))
#+end_src

** Magit

Magit is a magical git interface for Emacs.

#+begin_src emacs-lisp
  (use-package magit
    :commands (magit-status)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** Projectile

Use projectile for project management. (Rarely used)

#+begin_src emacs-lisp :tangle no
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map))
#+end_src

** Eldoc

#+begin_src emacs-lisp
  (use-package eldoc-box
    :config
    (set-face-attribute 'eldoc-box-body nil :font "Sarasa UI CL")
    :hook
    (eglot-managed-mode . eldoc-box-hover-mode))
#+end_src

* Shell

** Eshell

#+begin_src emacs-lisp
  (use-package eshell
    :custom
    (eshell-scroll-to-bottom-on-input t)
    (eshell-history-size 10000)
    (eshell-save-history-on-exit t)
    (eshell-hist-ignoredups t)
    :config
    (setq-local tab-aways-indent 'complete))
#+end_src

This is a function for create new eshell instance:

#+begin_src emacs-lisp
(defun mine/shell-create (name)
   "Create a custom-named eshell buffer with NAME."
   (interactive "sName: ")
   (eshell 'new)
   (let ((new-buffer-name (concat "*eshell-" name "*")))
     (rename-buffer new-buffer-name t)))
#+end_src

** Capf-autosuggest

This is a package provide fish-like inline completion.

#+begin_src emacs-lisp
  (use-package capf-autosuggest
    :hook
    (eshell-mode . capf-autosuggest-mode))
#+end_src

* Org-mode

** Main

Org-mode hook

#+begin_src emacs-lisp
  (defun mine/org-mode-setup ()
    (org-indent-mode)
    (auto-fill-mode 0)
    (display-line-numbers-mode 0)
    ;; (setq evil-auto-intent nil)
    (setq word-wrap-by-category t))
#+end_src

Main org-mode config. Using noweb for sake of simplicity.

#+begin_src emacs-lisp :noweb yes :tangle yes
  (use-package org
    :hook (org-mode . mine/org-mode-setup)
    :custom
    <<Org Agenda Settings>>

    <<Org Capture Templates>>

    (org-preview-latex-default-process 'dvisvgm)
    (org-format-latex-options '(:scale 0.4))
    (org-todo-keywords
     '((sequence "TODO(t)" "|" "DONE(d!)")
       (sequence "TOREAD" "READING" "|" "READ")))

    :config
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    <<Org Habit>>

    <<Org Tempo>>

    <<Org Babel>>)
#+end_src

** Auto tangle config

Config org-babel-tangle to auto export files in =.emacs.d=.

#+begin_src emacs-lisp :tangle yes
  (defun mine/org-babel-tangle-config ()
    (when (file-equal-p (file-name-directory (buffer-file-name))
  		      (expand-file-name "~/.emacs.d"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mine/org-babel-tangle-config)))
#+end_src

** Agenda

#+Name: Org Agenda Settings
#+begin_src emacs-lisp :tangle no
  (org-agenda-files '("~/org/"))
  (org-agenda-start-with-log-mode t)
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-refile-targets
   '(("archive.org" :maxlevel . 1)))
  (org-agenda-window-setup 'only-window)

  ;; Customs
  (org-agenda-custom-commands
   '(("d" "Dashboard" ;;Agenda Dashboard
      ((agenda "" ((org-deadline-warning-days 7)))
       (todo "TODO"
  	     ((org-agenda-overriding-header "All Tasks")))))))
#+end_src

** Babel

#+Name: Org Babel
#+begin_src emacs-lisp :tangle no
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t)))
#+end_src

** Capture

#+Name: Org Capture Templates
#+begin_src emacs-lisp :tangle no
  (org-capture-templates
   '(("t" "Todo" entry (file+headline "~/org/todo.org" "Inbox")
      "* TODO %?")
     ("l" "Literature Note" plain (file "~/org/tmp.org")
      (file "100_Zotero/template.org"))
     ("b" "Toread" entry (file "~/org/booklist.org")
      "* TOREAD %?\n:PROPERTIES:\n:author:\n:rate:\n:END:")))
#+end_src

** Habit

#+Name: Org Habit
#+begin_src emacs-lisp :tangle no
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
#+end_src

** Tempo

#+Name: Org Tempo
#+begin_src emacs-lisp :tangle no
  (require 'org-tempo)
  (add-to-list 'org-modules 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("cf" . "src conf"))
#+end_src

** Org to clipboard

#+begin_src emacs-lisp
(defun org-to-clipboard ()
  "Convert the contents of the current buffer or region from Org
mode to HTML.   Store the result in the clipboard."
  (interactive)
  (if (use-region-p)
      (shell-command-on-region (region-beginning)
                               (region-end)
                               "org2clip")
      (shell-command-on-region (point-min)
                               (point-max)
                               "org2clip")))
#+end_src

