init.el

(use-package corfu
  :hook
  (prog-mode . corfu-mode)
  (ledger-mode . corfu-mode)
  (eshell-mode . corfu-mode)
  :custom
  (corfu-auto t)
  (corfu-auto-prefix 3)
  (corfu-auto-delay 0.0)
  :config
  (keymap-unset corfu-map "RET"))

(use-package nerd-icons-corfu
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(use-package helpful
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

(use-package perspective
  :bind
  ("C-x C-b" . persp-list-buffers)
  :custom
  (persp-state-default-file (expand-file-name "persp-state" user-emacs-directory))
  (persp-mode-prefix-key (kbd "C-c M-p"))  ; pick your own prefix key here
  :init
  (persp-mode)
  :config
  (add-hook 'kill-emacs-hook #'persp-state-save)
  (add-hook 'after-init-hook
            (lambda () (persp-state-load persp-state-default-file)))
  (with-eval-after-load 'consult
    (consult-customize consult--source-buffer :hidden t :default nil)
    (add-to-list 'consult-buffer-sources persp-consult-source)))

(use-package eglot
  :hook
  (rust-mode . eglot-ensure)
  (python-mode . eglot-ensure)
  :config
  ;; Change the inlay hint face to make it slightly more visible
  (set-face-attribute 'eglot-inlay-hint-face nil :foreground "#8ba34a"))

(use-package python
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :custom
  (python-shell-virtualenv-root "~/venv"))

(use-package rust-mode)

(use-package geiser)

(use-package geiser-guile
  :after geiser
  :custom
  (geiser-active-implementations '(guile))
  (geiser-guile-binary "/usr/bin/guile")
  (geiser-repl-autodoc-p t))

(use-package paredit
  :hook (scheme-mode . paredit-mode))

;; (use-package flycheck
;;   :ensure t
;;   :init
;;   (global-flycheck-mode)
;;   (flymake-mode -1)
;;   :custom
;;   (lsp-diagnostics-provider :flycheck))

(use-package origami
  :hook (prog-mode . origami-mode))

(use-package magit
  :commands (magit-status)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package eldoc-box
  :config
  (set-face-attribute 'eldoc-box-body nil :font "Sarasa UI CL")
  :hook
  (eglot-managed-mode . eldoc-box-hover-mode))

(use-package eshell
  :custom
  (eshell-scroll-to-bottom-on-input t)
  (eshell-history-size 10000)
  (eshell-save-history-on-exit t)
  (eshell-hist-ignoredups t)
  :config
  (setq-local tab-aways-indent 'complete))

(defun mine/shell-create (name)
   "Create a custom-named eshell buffer with NAME."
   (interactive "sName: ")
   (eshell 'new)
   (let ((new-buffer-name (concat "*eshell-" name "*")))
     (rename-buffer new-buffer-name t)))

(use-package capf-autosuggest
  :hook
  (eshell-mode . capf-autosuggest-mode))

(defun mine/org-mode-setup ()
  (org-indent-mode)
  (auto-fill-mode 0)
  (display-line-numbers-mode 0)
  ;; (setq evil-auto-intent nil)
  (setq word-wrap-by-category t))

(use-package org
  :hook (org-mode . mine/org-mode-setup)
  :custom
  (org-agenda-files '("~/org/"))
  (org-agenda-start-with-log-mode t)
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-refile-targets
   '(("archive.org" :maxlevel . 1)))
  (org-agenda-window-setup 'only-window)
  
  ;; Customs
  (org-agenda-custom-commands
   '(("d" "Dashboard" ;;Agenda Dashboard
      ((agenda "" ((org-deadline-warning-days 7)))
       (todo "TODO"
  	     ((org-agenda-overriding-header "All Tasks")))))))

  (org-capture-templates
   '(("t" "Todo" entry (file+headline "~/org/todo.org" "Inbox")
      "* TODO %?")
     ("l" "Literature Note" plain (file "~/org/tmp.org")
      (file "100_Zotero/template.org"))
     ("b" "Toread" entry (file "~/org/booklist.org")
      "* TOREAD %?\n:PROPERTIES:\n:author:\n:rate:\n:END:")))

  (org-preview-latex-default-process 'dvisvgm)
  (org-format-latex-options '(:scale 0.4))
  (org-todo-keywords
   '((sequence "TODO(t)" "|" "DONE(d!)")
     (sequence "TOREAD" "READING" "|" "READ")))

  :config
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

  (require 'org-tempo)
  (add-to-list 'org-modules 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("cf" . "src conf"))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t))))

(defun mine/org-babel-tangle-config ()
  (when (file-equal-p (file-name-directory (buffer-file-name))
		      (expand-file-name "~/.emacs.d"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mine/org-babel-tangle-config)))

(defun org-to-clipboard ()
  "Convert the contents of the current buffer or region from Org
mode to HTML.   Store the result in the clipboard."
  (interactive)
  (if (use-region-p)
      (shell-command-on-region (region-beginning)
                               (region-end)
                               "org2clip")
      (shell-command-on-region (point-min)
                               (point-max)
                               "org2clip")))

(use-package org-roam
  :ensure t
  :custom
