init.org
** Org-roam

Customised =org-roam-preview-funtion=, return current line.

#+begin_src emacs-lisp
  (defun mine/org-roam-preview-function ()
      (let* ((elem (org-element-context))
             (parent (org-element-property :parent elem)))
        (string-trim-right (buffer-substring-no-properties
                            (org-element-property :begin parent)
                            (org-element-property :end parent)))))
#+end_src

#+begin_src emacs-lisp

  (use-package org-roam
    :ensure t
    :custom
    (org-roam-directory (concat org-directory "/roam"))
    (org-roam-completion-everywhere t)
    (org-roam-preview-function #'mine/org-roam-preview-function)
    (org-roam-capture-templates
     '(("d" "default" plain "%?"
        :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)
       ("a" "anime" plain (file "~/org/roam/templates/anime.org")
        :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Anime\n#+season: %^{Season}\n#+rating: %^{Rating}\n")
        :unnarrowed t)))
    (org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    :bind
    (("C-M-i" . org-roam-node-insert))
    :config
    (org-roam-setup)
    )
#+end_src

*** Org-roam-ui

#+begin_src emacs-lisp
  (use-package org-roam-ui)
#+end_src

* TeX

#+begin_src emacs-lisp
  (use-package tex
    :ensure auctex
    :custom
    (TeX-auto-save t)
    (TeX-parse-self t)
    :config
    (setq-default TeX-master nil)
    )
#+end_src

* File Management

** Dired

Dired is the default file management utility for emacs and it works well in most cases.

#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom 
    (dired-kill-when-opening-new-dired-buffer t)
    (dired-listing-switches "-agho --group-directories-first")
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file))
#+end_src

*** Icons

To have icons in dired, nerd-icons-dired is needed.

#+begin_src emacs-lisp
  (use-package nerd-icons-dired
    :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

*** Git ignore
#+begin_src emacs-lisp
  (use-package dired-gitignore
    :config
    (dired-gitignore-global-mode t))
#+end_src

* Visual

** Modeline

Doom modeline is a good looking modeline for Emacs.
The default behavior is good enough.

#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1))
#+end_src

** Fill Column

Visual-fill-column is used for display org-mode and latex-mode contents in the middle of screen.

#+begin_src emacs-lisp
  (defun mine/visual-fill-setup ()
    (setq visual-fill-column-width 80
  	visual-fill-column-center-text t)
    (visual-fill-column-mode 1)
    (visual-line-mode))
  (use-package visual-fill-column
    :defer t
    :hook ((org-mode LaTeX-mode) . mine/visual-fill-setup))
#+end_src

** Split Settings

Use [[https://github.com/ajgrf/edwina][edwina]] to manage splitting.

#+begin_src emacs-lisp :tangle no
  (use-package edwina
    :config
    (edwina-mode 1))
#+end_src

Small trick to prevent buffers from poppling everywhere:

#+begin_src emacs-lisp :tangle yes
(customize-set-variable 'display-buffer-base-action
  '((display-buffer-reuse-window display-buffer-same-window)
    (reusable-frames . t)))

(customize-set-variable 'even-window-sizes nil)     ; avoid resizing
#+end_src

#+RESULTS:

** Popper

[[https://github.com/karthink/popper][Popper]] provides popup windows for Emacs, which is handy for buffers you need immediately and want them disappear immediately.

#+begin_src emacs-lisp :tangle yes
  (use-package popper
    :ensure t
    :bind (("C-`"   . popper-toggle)
           ("M-`"   . popper-cycle)
           ("C-M-`" . popper-toggle-type))
    :init
    (setq popper-reference-buffers
          '("\\*Messages\\*"
            "\\*Async Shell Command\\*"
  	  org-roam-mode
            helpful-mode
            eshell-mode
            compilation-mode))
    (popper-mode +1)
    (popper-echo-mode +1))
#+end_src

* Command Line

** VTerm

Use vterm for most terminal fuctions.

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :custom
    (vterm-timer-delay nil)
    (vterm-max-scrollback 10000)
    (vterm-shell "/bin/fish")
    :config
    (setq term-prompt-regexp "^❯ *") ;; This works not as intended
    )
#+end_src

* Input Methond

** Rime

Use emacs-rime for Chinese input.

#+begin_src emacs-lisp
  (use-package rime
    :bind
    (:map rime-mode-map
          ("C-`" . 'rime-send-keybinding))
    :custom
    (default-input-method "rime")
    (rime-show-candidate 'posframe)
    (rime-posframe-style 'horizonal)
    (rime-posframe-properties (list :internal-border-width 10
                                  :font "Sarasa UI CL Medium")))
#+end_src

* Ledger-mode

Ledger mode is for ledger, a plain text accounting tool.

#+begin_src emacs-lisp
  (use-package ledger-mode
    :init
    (setq ledger-clear-whole-transactions 1)
    :config
    (add-to-list 'evil-emacs-state-modes 'ledger-report-mode)
    :custom
    (ledger-reports
     '(("bal" "%(binary) --strict -f ~/org/PTA/keep.ledger bal")))
    (ledger-accounts-file "~/org/PTA/accounts.ledger")
    :mode "\\.ledger\\'")
#+end_src

* Profiling

#+begin_src emacs-lisp
(defun mine/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'mine/display-startup-time)
#+end_src
