init.el
  (org-roam-directory (concat org-directory "/roam"))
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "default" plain "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("a" "anime" plain (file "~/org/roam/templates/anime.org")
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Anime\n#+season: %^{Season}\n#+rating: %^{Rating}\n")
      :unnarrowed t)))
  (org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  :bind
  (("C-M-i" . org-roam-node-insert))
  :config
  (org-roam-setup)
  )

(use-package org-roam-ui)

(use-package tex
  :ensure auctex
  :custom
  (TeX-auto-save t)
  (TeX-parse-self t)
  :config
  (setq-default TeX-master nil)
  )

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom 
  (dired-kill-when-opening-new-dired-buffer t)
  (dired-listing-switches "-agho --group-directories-first")
  )
;;    :config
;; (evil-collection-define-key 'normal 'dired-mode-map
;;      ;;"h" 'dired-up-directory
;; "l" 'dired-find-file))

(use-package nerd-icons-dired
  :hook (dired-mode . nerd-icons-dired-mode))

(use-package dired-gitignore
  :config
  (dired-gitignore-global-mode t))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))

(defun mine/visual-fill-setup ()
  (setq visual-fill-column-width 80
	visual-fill-column-center-text t)
  (visual-fill-column-mode 1)
  (visual-line-mode))
(use-package visual-fill-column
  :defer t
  :hook ((org-mode LaTeX-mode) . mine/visual-fill-setup))

(use-package edwina
  :config
  (edwina-mode 1))

(customize-set-variable 'display-buffer-base-action
  '((display-buffer-reuse-window display-buffer-same-window)
    (reusable-frames . t)))

(customize-set-variable 'even-window-sizes nil)     ; avoid resizing

(use-package popper
  :ensure t
  :bind (("C-`"   . popper-toggle)
         ("M-`"   . popper-cycle)
         ("C-M-`" . popper-toggle-type))
  :init
  (setq popper-reference-buffers
        '("\\*Messages\\*"
          "\\*Async Shell Command\\*"
	  org-roam-mode
          helpful-mode
          eshell-mode
          compilation-mode))
  (popper-mode +1)
  (popper-echo-mode +1))

(use-package vterm
  :commands vterm
  :custom
  (vterm-timer-delay nil)
  (vterm-max-scrollback 10000)
  (vterm-shell "/bin/fish")
  :config
  (setq term-prompt-regexp "^❯ *") ;; This works not as intended
  )

(use-package rime
  :bind
  (:map rime-mode-map
        ("C-`" . 'rime-send-keybinding))
  :custom
  (default-input-method "rime")
  (rime-show-candidate 'posframe)
  (rime-posframe-style 'horizonal)
  (rime-posframe-properties (list :internal-border-width 10
                                :font "Sarasa UI CL Medium")))

(use-package ledger-mode
  :init
  (setq ledger-clear-whole-transactions 1)
  :config
  (add-to-list 'evil-emacs-state-modes 'ledger-report-mode)
  :custom
  (ledger-reports
   '(("bal" "%(binary) --strict -f ~/org/PTA/keep.ledger bal")))
  (ledger-accounts-file "~/org/PTA/accounts.ledger")
  :mode "\\.ledger\\'")

(defun mine/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'mine/display-startup-time)
